#+TITLE: Ruby Khipu
#+AUTHOR: Grant Shangreaux

*** Building a Cord from a String

Let's build a string for the number 123. Like the example above I will use ~-~ dash characters to stand for an empty place on the cord. Ruby even lets us send the message ~to_i~ to a ~String~ to turn it into an ~Integer~. First build the empty cord, and demonstrate its integer value is zero:

#+begin_src ruby :exports both
  cord = "---"
  cord.to_i
#+end_src

#+RESULTS:
: 0

Next we want to set the units place to 3. We can interact with a /slice/ of a string using the "index operator" ~[]~. Counting up from ~0~ each slice of the string can be interacted with individually. Here's setting the units place to 3:

#+begin_src ruby :exports both
  cord = "---"
  cord[2] = 3.to_s
  cord
#+end_src

#+RESULTS:
: --3

#+begin_src ruby :exports both
  cord = "---"
  cord[2] = 3.to_s # set the units
  cord[1] = 2.to_s # set the tens
  cord[0] = 1.to_s # set the hundreds
  cord
#+end_src

#+RESULTS:
: 123

So far so good, but if we want to actually use this data for operations beyond just storing information, more work is needed. Strings can be added together, but it doesn't behave in a way that would work for any accounting:

#+begin_src ruby :exports both
  "123" + "321"
#+end_src

#+RESULTS:
: 123321

*** One More Step on this False Start

Ruby has many ways to express data and behavior. One way to allow ~String~ objects to act like Khipu Cords is to define a new /message/ strings can respond to. We call this "define ~method~ for objects of type ~Class~". So we will ~refine~ the ~String~ class with a new ~method~ called ~add_cord~. Then all string objects will know how to respond to receiving the ~add_cord~ message.

#+begin_src ruby :exports both
  module Khipu
    refine String do
      def add_cord(other)
        result = self.to_i + other.to_i
        result.to_s
      end
    end
  end

  using Khipu

  cord1 = "123"
  cord1.add_cord("321")
#+end_src

#+RESULTS:
: 444

This shows that we are able to define behavior on Ruby objects to express both Khipu as a heirarchical, partially sorted, grouped and summed data storage object, and a living object that has behavior for changing and interpreting it.

Changing the behavior of ~String~ objects in Ruby would be one way to do this, but we will define new Khipu-specific objects modeling their nature.

** Knots are Compound Data

The smallest unit of a Khipu is a ~Knot~.

Knots are like bytes, in that they could represent different kinds of information. For the initial example, we assume that a khipu is composed of groups of cords where each knot is of the same type. In our case, it is Integers, but a Knot could be anything really. Perhaps the color of the Cord tells you how to interpret the knots in a cord. Practically, keeping the elements of a Cord as Integers, but allowing arbitrarily high numbers would work like a primary key pointer to some other data structure. This would screw up the methods for adding things together.

However, see:

https://nithinbekal.com/posts/numeric-operations-value-objects/

#+name: Knot
#+begin_src ruby :results none
  Knot = Data.define(:digit, :spin) do
    @digits = Set.new(0..9).freeze
    @spins = Set.new(%i[s z u]).freeze
    def self.digits = @digits
    def self.spins = @spins

    def self.[](...) = new(...)
    def self.s_spin(digit) = new(digit:, spin: :s)
    def self.z_spin(digit) = new(digit:, spin: :z)

    def initialize(digit:, spin: :u)
      digit = Integer(digit)
      spin = spin.to_sym
      validate(digit, spin)

      super(digit:, spin:)
    end

    def inspect = "#{self.class}<#{digit}:#{spin}>"

    private

    def validate(digit, spin)
      validate_digit(digit)
      validate_spin(spin)
    end

    def validate_digit(digit)
      return if Knot.digits.include?(digit)

      raise(ArgumentError, "Knots can only be digits from 0-9.")
    end

    def validate_spin(spin)
      return if Knot.spins.include?(spin.to_sym)

      raise(ArgumentError, "Spins must be s, z, or u.")
    end
  end

  class Long < Knot; end
  class Figure8 < Knot; end
#+end_src

#+begin_src ruby :results output :noweb yes
  <<Knot>>

  error = begin
            Knot[10]
          rescue ArgumentError => e
            e
          end

  error2 = begin
             Knot[digit: 1, spin: :crazy]
           rescue ArgumentError => e
             e
           end

  pp [
    [Knot[1]],
    [Knot[digit: 2, spin: :z]],
    [Long.s_spin(3)],
    [Figure8.z_spin(4)],
    [error],
    [error2]
  ]
 #+end_src

 #+RESULTS:
 : [[#<data Knot digit=1, spin=:u>],
 :  [#<data Knot digit=2, spin=:z>],
 :  [#<data Long digit=3, spin=:s>],
 :  [#<data Figure8 digit=4, spin=:z>],
 :  [#<ArgumentError: Knots can only be digits from 0-9.>],
 :  [#<ArgumentError: Spins must be s, z, or u.>]]

** Optimizing Cord to Integer

#+begin_src ruby :results output :exports both
  @knots = [1,2,3,4,5,6,7,8,9,0]

  def coercion
    @knots.join.to_i
  end

  def functional
    @knots.reduce(0) { |memo, i| memo * 10 + i }
  end

  def imperative_each
    result = 0
    @knots.each do |i|
      result = result * 10 + i
    end
    result
  end

  def imperative_while
    result = 0
    i = 0
    len = @knots.length
    while i < len
      result = result * 10 + @knots[i]
      i += 1
    end
    result
  end

  require 'benchmark'

  n = 1_000_000

  Benchmark.bm do |x|
    x.report("coercion:") { n.times { coercion } }
    x.report("functional") { n.times { functional } }
    x.report("imperative_each:") { n.times { imperative_each } }
    x.report("imperative_while:") { n.times { imperative_while } }
  end
#+end_src

#+RESULTS:
:                        user     system      total        real
: coercion:          0.766777   0.003551   0.770328 (  0.770378)
: functional         0.350813   0.001270   0.352083 (  0.352157)
: imperative_each:   0.266080   0.000249   0.266329 (  0.266360)
: imperative_while:  0.257264   0.000087   0.257351 (  0.257376)

** COMMENT Create a Knot Abstraction?

Knots are like bytes, in that they could represent different kinds of information.
For the initial example, we assume that a khipu is composed of groups of cords where
each knot is of the same type. In our case, it is Integers, but a Knot could be
anything really. Perhaps the color of the Cord tells you how to interpret the knots
in a cord. Practically, keeping the elements of a Cord as Integers, but allowing
arbitrarily high numbers would work like a primary key pointer to some other
data structure. This would screw up the methods for adding things together.

However, see:

https://nithinbekal.com/posts/numeric-operations-value-objects/

#+begin_src ruby :session knots :exports both, :results none
  Knot = Data.define(:digit, :spin) do
    @digits = Set.new(0..9).freeze
    @spins = Set.new(%i[s z u]).freeze
    def self.digits = @digits
    def self.spins = @spins

    def self.[](...) = new(...)
    def self.s_spin(digit) = new(digit:, spin: :s)
    def self.z_spin(digit) = new(digit:, spin: :z)

    def initialize(digit:, spin: :u)
      digit = Integer(digit)
      spin = spin.to_sym
      validate(digit, spin)

      super(digit:, spin:)
    end

    def inspect = "#{self.class}<#{digit}:#{spin}>"

    private

    def validate(digit, spin)
      validate_digit(digit)
      validate_spin(spin)
    end

    def validate_digit(digit)
      return if Knot.digits.include?(digit)

      raise(ArgumentError, "Knots can only be digits from 0-9.")
    end

    def validate_spin(spin)
      return if Knot.spins.include?(spin.to_sym)

      raise(ArgumentError, "Spins must be s, z, or u.")
    end
  end

  class Long < Knot; end
  class Figure8 < Knot; end
#+end_src

#+begin_src ruby :session knots :results value
  error = begin
            Knot[10]
          rescue ArgumentError => e
            e
          end

  error2 = begin
             Knot[digit: 1, spin: :crazy]
           rescue ArgumentError => e
             e
           end

  [
    [Knot[1]],
    [Knot[digit: 2, spin: :z]],
    [Knot.s_spin(3)],
    [Knot.z_spin(4)],
    [error],
    [error2]
  ]
 #+end_src

 #+RESULTS:
 : '((Knot<1:u>)  (Knot<2:z>)  (Knot<3:s>)  (Knot<4:z>)  (#<ArgumentError: Knots can only be digits from 0-9.>)  (#<ArgumentError: Spins must be s  z  or u.>))


*** COMMENT Knot with arithmetic operators and #coerce

This doesn't make sense for a Knot currently, they dont represent full
Numerics, only the base 10 digit symbols.

#+begin_src ruby :session knots_draft_1
  Knot = Data.define(:digit) do
    DIGITS = Set.new(0..9).freeze

    def initialize(digit:)
      digit = Integer(digit)
      raise(ArgumentError, "Must be digit 0-9.") unless DIGITS.include?(digit)

      super(digit:)
    end

    def +(other)
      wrap(other).then { |wrapped| Knot[digit + wrapped.digit] }
    end

    def -(other)
      wrap(other).then { |wrapped| Knot[digit - wrapped.digit] }
    end

    def *(other)
      wrap(other).then { |wrapped| Knot[digit * wrapped.digit] }
    end

    def /(other)
      wrap(other).then { |wrapped| Knot[digit / wrapped.digit] }
    end

    def **(n) = Knot[digit**n]
    def -@ = self * -1

    def coerce(n) = [Knot[n], self]
    def inspect = "Knot(#{digit})"

    private

    def wrap(value) = value.is_a?(Knot) ? value : Knot[value]
  end

  [[Knot[1]], [Knot[2]]]
#+end_src

#+RESULTS:
| Knot | (1) |
| Knot | (2) |


